
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Ложь);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СрокиОФД");
	НастройкиВарианта.Описание = 
		НСтр("ru = 'Создает отчет по просроченным срокам ОФД'");
	НастройкиВарианта.НастройкиДляПоиска.ИменаМакетов = "СрокиОФД";
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СрокиФН");
	НастройкиВарианта.Описание = 
		НСтр("ru = 'Создает отчет по просроченным срокам фискальных накопителей'");
	НастройкиВарианта.НастройкиДляПоиска.ИменаМакетов = "СрокиФН";
	
КонецПроцедуры