
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТЗ Из ТаблицаПлатежей Цикл
		СтрокаТЗ.Флаг = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТЗ Из ТаблицаПлатежей Цикл
		СтрокаТЗ.Флаг = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьСтрокиНаСервере()
	
	Для Каждого СтрокаТЗ Из ТаблицаПлатежей Цикл
		
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СкопироватьСтрокиЗавершение", ЭтотОбъект), "Скопировать строки в текущий финансовый план?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтрокиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		СкопироватьСтрокиНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуПлатежейИзДокумента(Флаг = Ложь)
	
	ТаблицаПлатежей.Очистить();
	
	Если ЗначениеЗаполнено(ФинансовыйПлан) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ФинансовыйПланПланирование.НомерСтроки КАК НомерСтроки,
		|	ФинансовыйПланПланирование.Организация КАК Организация,
		|	ФинансовыйПланПланирование.СчетОрганизации КАК СчетОрганизации,
		|	ФинансовыйПланПланирование.Контрагент КАК Контрагент,
		|	ФинансовыйПланПланирование.СчетКонтрагента КАК СчетКонтрагента,
		|	ФинансовыйПланПланирование.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ФинансовыйПланПланирование.Сумма КАК Сумма,
		|	ФинансовыйПланПланирование.Валюта КАК Валюта,
		|	ИСТИНА КАК Флаг,
		|	ФинансовыйПланПланирование.Комментарий КАК Комментарий,
		|	ФинансовыйПланПланирование.СтатьяДДС КАК СтатьяДДС,
		|	ФинансовыйПланПланирование.ВалютнаяСумма КАК ВалютнаяСумма,
		|	ФинансовыйПланПланирование.АвторСтроки КАК АвторСтроки
		|ИЗ
		|	Документ.ФинансовыйПлан.Планирование КАК ФинансовыйПланПланирование
		|ГДЕ
		|	ФинансовыйПланПланирование.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", ФинансовыйПлан);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = ТаблицаПлатежей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
			НоваяСтрока.Флаг = Флаг;
			
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(УдалитьИсходныеСтроки = Ложь, ОчиститьИсходныйДокумент = Ложь) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ФинансовыйПлан", ФинансовыйПлан);
	
	МассивСтрок = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ТаблицаПлатежей Цикл
		
		Если НЕ СтрокаТЗ.Флаг Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок.Добавить(СтрокаТЗ.НомерСтроки);
		
	КонецЦикла;
	
	СтруктураВозврата.Вставить("МассивСтрок", МассивСтрок);
	СтруктураВозврата.Вставить("УдалитьИсходныеСтроки", УдалитьИсходныеСтроки);
	СтруктураВозврата.Вставить("ОчиститьИсходныйДокумент", ОчиститьИсходныйДокумент);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФинансовыйПлан(Команда)
	
	ТекущиеДанные = Элементы.СписокФинансовыхПланов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ФинансовыйПлан = ТекущиеДанные.Ссылка;
		Элементы.ГруппаСписокФинансовыхПланов.Видимость = Ложь;
		Элементы.ГруппаТаблицаПлатежей.Видимость = Истина;
		ЗаполнитьТаблицуПлатежейИзДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаСписокФинансовыхПланов.Видимость = Истина;
	Элементы.ГруппаТаблицаПлатежей.Видимость = Ложь;
	
	Если Параметры.Свойство("ТекущийДокумент") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокФинансовыхПланов, "ТекущийДокумент", Параметры.ТекущийДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФинансовыхПлановВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// ВыбратьФинансовыйПлан(Неопределено);
	ОбъединитьЦеликом(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьЦеликом(Команда)
	
	ТекущиеДанные = Элементы.СписокФинансовыхПланов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		//ПоказатьВопрос(Новый ОписаниеОповещения("ОбъединитьЦеликомЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), "Объединить со всеми строками плана " + ТекущиеДанные.Ссылка + "?", РежимДиалогаВопрос.ДаНет);
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Скопировать", "Скопировать");
		СписокКнопок.Добавить("Перенести", "Перенести");
		СписокКнопок.Добавить("Отмена", "Отмена");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбъединитьЦеликомЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), "Объединить со всеми строками плана " + ТекущиеДанные.Ссылка + "?", СписокКнопок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьЦеликомЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	ФинансовыйПлан = ТекущиеДанные.Ссылка;

	Если РезультатВопроса = "Скопировать" Тогда
		
		ЗаполнитьТаблицуПлатежейИзДокумента(Истина);
		ПеренестиВДокумент();
		
	ИначеЕсли РезультатВопроса = "Перенести" Тогда
		
		ЗаполнитьТаблицуПлатежейИзДокумента(Истина);
		ПеренестиВДокумент(Истина, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументСтроки(Команда)
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("Скопировать", "Скопировать");
	СписокКнопок.Добавить("Перенести", "Перенести");
	СписокКнопок.Добавить("Отмена", "Отмена");
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПеренестиВДокументСтрокиЗавершение", ЭтотОбъект), "Объединить со строками плана?", СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументСтрокиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	//ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	//ФинансовыйПлан = ТекущиеДанные.Ссылка;

	Если РезультатВопроса = "Скопировать" Тогда
		
		//ЗаполнитьТаблицуПлатежейИзДокумента(Истина);
		ПеренестиВДокумент();
		
	ИначеЕсли РезультатВопроса = "Перенести" Тогда
		
		//ЗаполнитьТаблицуПлатежейИзДокумента(Истина);
		ПеренестиВДокумент(Истина);
		
	КонецЕсли;
	
КонецПроцедуры



