
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОстаткиДенежныхСредств") Тогда
		ОстаткиДенежныхСредствПлюс = ?(Параметры.ОстаткиДенежныхСредств > 0, Параметры.ОстаткиДенежныхСредств, 0);
		ОстаткиДенежныхСредствМинус = ?(Параметры.ОстаткиДенежныхСредств < 0, -Параметры.ОстаткиДенежныхСредств, 0);
	КонецЕсли;
	
	Если Параметры.Свойство("ПланированиеТекущийДень") Тогда
		ПланированиеТекущийДеньПлюс = ?(Параметры.ПланированиеТекущийДень > 0, Параметры.ПланированиеТекущийДень, 0);
		ПланированиеТекущийДеньМинус = ?(Параметры.ПланированиеТекущийДень < 0, -Параметры.ПланированиеТекущийДень, 0);
	КонецЕсли;
	
	Если Параметры.Свойство("ПредварительноеПланирование") Тогда
		ПредварительноеПланированиеПлюс = ?(Параметры.ПредварительноеПланирование > 0, Параметры.ПредварительноеПланирование, 0);
		ПредварительноеПланированиеМинус = ?(Параметры.ПредварительноеПланирование < 0, -Параметры.ПредварительноеПланирование, 0);
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийДокумент") Тогда
		ТекущийДокументПлюс = ?(Параметры.ТекущийДокумент > 0, Параметры.ТекущийДокумент, 0);
		ТекущийДокументМинус = ?(Параметры.ТекущийДокумент < 0, -Параметры.ТекущийДокумент, 0);
	КонецЕсли;
	
	Если Параметры.Свойство("ОстатокНаСчете") Тогда
		ИтогоПлюс = ?(Параметры.ОстатокНаСчете > 0, Параметры.ОстатокНаСчете, 0);
		ИтогоМинус = ?(Параметры.ОстатокНаСчете < 0, -Параметры.ОстатокНаСчете, 0);
	КонецЕсли;

КонецПроцедуры
