
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 1 Тогда
		
		Запись = ЭтотОбъект[0];
		
		Набор = РегистрыСведений.ПривязкиДоговоровЦФУ.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(Запись.Период);
		Набор.Отбор.ДоговорКонтрагента.Установить(ЭтотОбъект[0].ДоговорКонтрагента);
		Набор.Прочитать();
		
		СуммаПроцентов = 0;
		Для Каждого Запись Из Набор Цикл
			СуммаПроцентов = СуммаПроцентов + Запись.Процент;
		КонецЦикла;
		
		Если СуммаПроцентов > 100 И НЕ Замещение Тогда
			Отказ = Истина;
			Сообщить("Сумма процентов за " + Формат(Запись.Период, "ДФ=dd.MM.yyyy") + " больше 100%!");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


