
Процедура ПриЗаписи(Отказ)
	
	Для Каждого СтрокаТЧ Из ВладельцыФайла Цикл
		
		Запись = РегистрыСведений.НаличиеФайлов.СоздатьМенеджерЗаписи();
		Запись.ЕстьФайлы = Истина;
		Запись.ОбъектСФайлами = СтрокаТЧ.ВладелецФайла;
		Запись.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ВладельцыФайла.Очистить();
	НоваяСтрока = ВладельцыФайла.Добавить();
	НоваяСтрока.ВладелецФайла = ЭтотОбъект.ВладелецФайла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПарныеДоговоры.ПарныйДоговор КАК ПарныйДоговор
	|ИЗ
	|	РегистрСведений.ПарныеДоговоры КАК ПарныеДоговоры
	|ГДЕ
	|	ПарныеДоговоры.Договор = &Договор");
	
	Запрос.УстановитьПараметр("Договор", ЭтотОбъект.ВладелецФайла);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		НоваяСтрока = ВладельцыФайла.Добавить();
		НоваяСтрока.ВладелецФайла = Выборка.ПарныйДоговор;
		
	КонецЕсли;
	
КонецПроцедуры

