
Процедура _ВычислитьХешПрисоединенногоФайлаОбработчик(Источник) Экспорт
	
	//Запись = РегистрыСведений.ХэшиФайлов.СоздатьМенеджерЗаписи();
	//Запись.Файл = Источник.Ссылка;
	//
	//Хеш = Новый ХешированиеДанных(ХешФункция.MD5); 
	////Хеш.Добавить(ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Источник.Ссылка));
	//
	//Хеш.Добавить(РаботаСФайлами.ДвоичныеДанныеФайла(Источник.Ссылка));
	//
	//Запись.ХэшMD5 = СтрЗаменить(СокрЛП(Хеш.ХешСумма), " ", "");
	//Запись.Записать(Истина);
	
КонецПроцедуры


