
&НаСервере
Процедура РаботаСОчередьюРазрешенаПриИзмененииНаСервере()
	Очередь = Константы.РаботаСОчередьюSQLРазрешена.СоздатьМенеджерЗначения();
	Очередь.Значение = РаботаСОчередьюРазрешена;
	Очередь.Записать();
КонецПроцедуры

&НаКлиенте
Процедура РаботаСОчередьюРазрешенаПриИзменении(Элемент)
	РаботаСОчередьюРазрешенаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСОчередьюРазрешена = Константы.РаботаСОчередьюSQLРазрешена.Получить();	
	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОчередьSQL);
	РегламентноеЗаданиеВключено = Задание.Использование;
КонецПроцедуры

&НаСервере
Процедура РегламентноеЗаданиеВключеноПриИзмененииНаСервере()
	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОчередьSQL);
	Задание.Использование = РегламентноеЗаданиеВключено;
	Задание.Записать();
КонецПроцедуры

&НаКлиенте
Процедура РегламентноеЗаданиеВключеноПриИзменении(Элемент)
	РегламентноеЗаданиеВключеноПриИзмененииНаСервере();
КонецПроцедуры
