
&НаСервере
Процедура ПриоритетНаСервере(Данные, Выше)
	
	Если Данные.Приоритет = 1 И Выше Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.НастройкиИмпортаВыписок.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Если Данные.Приоритет = Набор.Количество() И НЕ Выше Тогда
		Возврат;
	КонецЕсли;
	
	ВременныйНомер = 10000;
	НомерНовогоПриоритета = Данные.Приоритет + (?(Выше, -1, 1));
	
	Для Каждого Запись Из Набор Цикл
		
		Если Запись.Приоритет = НомерНовогоПриоритета Тогда
			Запись.Приоритет = ВременныйНомер;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого Запись Из Набор Цикл
		
		Если Запись.Приоритет = Данные.Приоритет Тогда
			Запись.Приоритет = НомерНовогоПриоритета;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Запись Из Набор Цикл
		
		Если Запись.Приоритет = ВременныйНомер Тогда
			Запись.Приоритет = Данные.Приоритет;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаСортировки = Набор.Выгрузить();
	ТаблицаСортировки.Сортировать("Приоритет УБЫВ");
	
	т = ТаблицаСортировки.Количество();
	Для Каждого СтрокаТЗ Из ТаблицаСортировки Цикл
		СтрокаТЗ.Приоритет = т;
		т = т - 1;		
	КонецЦикла;
	
	Набор.Загрузить(ТаблицаСортировки);
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетВыше(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		СтруктураДанных = Новый Структура(СтруктураДанных());
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекущиеДанные);
		ПриоритетНаСервере(СтруктураДанных, Истина);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетНиже(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		СтруктураДанных = Новый Структура(СтруктураДанных());
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекущиеДанные);
		ПриоритетНаСервере(СтруктураДанных, Ложь);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураДанных()
	Возврат(Новый ФиксированнаяСтруктура("ВидОплаты, ПриходРасход, ПлательщикИНН, ПолучательИНН, ПоказательКБК, СтрокаПоиска, Приоритет"));	
КонецФункции
