// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Реквизиты организации
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Реквизиты";
	//КомандаПечати.Представление = НСтр("ru = 'Реквизиты'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеквизитовОрганизаций";
	//КомандаПечати.СписокФорм    = "ФормаОрганизации,ФормаСписка";
	//КомандаПечати.Порядок       = 1;
	//
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьСервисРегистрации") Тогда
	//	
	//	// Приказ о вступлении в должность руководителя
	//	КомандаПечати = КомандыПечати.Добавить();
	//	КомандаПечати.Идентификатор = "ПриказВступленииВДолжностьРуководителя";
	//	КомандаПечати.Представление = НСтр("ru = 'Приказ о вступлении в должность руководителя'");
	//	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	//	КомандаПечати.СписокФорм    = "ФормаОрганизации,ФормаСписка";
	//	КомандаПечати.Порядок       = 10;
	//	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ЮридическоеФизическоеЛицо",
	//		Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	//	
	//КонецЕсли;
	
КонецПроцедуры