
Функция СведенияОВнешнейОбработке() Экспорт

	РегистрационныеДанные = Новый Структура();
	РегистрационныеДанные.Вставить("Наименование", "Поиск и исправление дублей ИНН");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
	РегистрационныеДанные.Вставить("Версия", "1.0");
	РегистрационныеДанные.Вставить("Информация", "Поиск и исправление дублей ИНН");
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");

	ТаблицаКоманд = ПолучитьТаблицуКоманд();

	ДобавитьКоманду(ТаблицаКоманд,
	"Поиск и исправление дублей ИНН", // Представление команды в пользовательском интерфейсе
	"ОткрытьОбработку", // Уникальный идентификатор команды
	"ОткрытиеФормы", // Использование команды //ОткрытиеФормы
	Истина, // Показывать оповещение.
	"" // Дополнительный модификатор команды.
	);

	РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);	

	Возврат РегистрационныеДанные;

КонецФункции

Функция ПолучитьТаблицуКоманд()

	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;

КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры

