
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.Приоритет) Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	МАКСИМУМ(НастройкиИмпортаВыписок.Приоритет) КАК Приоритет
			|ИЗ
			|	РегистрСведений.НастройкиИмпортаВыписок КАК НастройкиИмпортаВыписок");
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Запись.Приоритет = Выборка.Приоритет + 1;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


