
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТаблицаЗаявок.Очистить();
	
	ДанныеЗаявок = РаботаСЗаявкамиСервер.ПолучитьДанныеЗаявок(Новый Структура("ДатаНачала, ДатаОкончания", Период.ДатаНачала, Период.ДатаОкончания));
	
	Если ДанныеЗаявок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Информация Из ДанныеЗаявок Цикл
		
		НоваяСтрока = ТаблицаЗаявок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Информация);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметку(Команда)
	Для Каждого СтрокаТаблицы Из ТаблицаЗаявок Цикл
		СтрокаТаблицы.Флаг = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	Для Каждого СтрокаТаблицы Из ТаблицаЗаявок Цикл
		СтрокаТаблицы.Флаг = Ложь;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Функция ПолучитьРезультирующийМассивДанных()
	
	МассивРезультат = Новый Массив;
	
	КолонкиНаПеренос = "ДатаЗаявки,НомерЗаявки,КатегорияОперации,СуммаКОплате,СуммаНДС," +
	"Валюта,НазначениеПлатежа,ДолжностьАвтора,Автор,Сводная,Казначейство,ЦФУ,Бренд,Комментарий," +
	"КурсОплатыФиксированный,Процент";
	
	МассивКолонокРезультата = СтрРазделить(КолонкиНаПеренос, ",");
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗаявок Цикл
		
		Если СтрокаТаблицы.Флаг Тогда
			СтруктураВозврата = Новый Структура;
			Для Каждого Колонка Из МассивКолонокРезультата Цикл
				СтруктураВозврата.Вставить(Колонка, СтрокаТаблицы[Колонка]);
			КонецЦикла;
			МассивРезультат.Добавить(СтруктураВозврата);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

&НаКлиенте
Процедура Перенести(Команда)
	
	МассивРезультат = ПолучитьРезультирующийМассивДанных();
	Закрыть(?(МассивРезультат.Количество() > 0, МассивРезультат, Неопределено));
	
КонецПроцедуры

